# Отчет по лабораторной работе № 12
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Болотин Антон Николаевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Системы программирования на языке Си
2. **Цель работы**: Попарно упорядочить цифры числа по возрастанию
3. **Задание ()**: Вариант 30. 

| Входные данные | Выходные данные |
|----------------|-----------------|
| 321            | 123             |       
| 123            | 123               | 

4. **Протокол**:
   
```
#include <stdio.h>

void swap(int *a, int *b) {
    int temp = *a;
    *a = *b;
    *b = temp;
}

void orderDigits(int *digits, int numDigits) {
    for (int i = 0; i < numDigits - 1; i += 2) {
        if (digits[i] > digits[i + 1]) {
            swap(&digits[i], &digits[i + 1]);
        }
    }
}

void pairwiseOrder(int number) {
    int numDigits = 0;
    int tempNumber = number;
    
    while (tempNumber != 0) {
        tempNumber /= 10;
        numDigits++;
    }

    int digits[numDigits];
    tempNumber = number;

    for (int i = numDigits - 1; i >= 0; i--) {
        digits[i] = tempNumber % 10;
        tempNumber /= 10;
    }

    orderDigits(digits, numDigits);

    printf("Число с упорядоченными цифрами: ");
    for (int i = 0; i < numDigits; i++) {
        printf("%d", digits[i]);
    }
    printf("\n");
}

int main() {
    int number;
    printf("Введите число: ");
    scanf("%d", &number);

    pairwiseOrder(number);

    return 0;
}
```
5. **Вывод**:  Работа является очень важной,также как и 11 лаба, так как написание этой программы позволит писать программы на С с использованием fsm
