# Отчет по лабораторной работе № 11
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Болотин Антон Николаевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Системы программирования на языке Си
2. **Цель работы**:Подсчитать количество слов с лексикографически возрастающими буквами латинского алфавита
3. **Задание ()**: Вариант 5. 

| Входные данные | Выходные данные |
|----------------|-----------------|
| abcd weqweq    | 1               |       
| a  aaa         | 1               | 

4. **Протокол**:
   
```
#include <stdio.h>
#include <ctype.h>

// Состояния конечного автомата
typedef enum {
    STATE_START,
    STATE_LEX_INCREASE,
    STATE_OTHER
} State;

int isLexIncreasing(const char *word) {
    char prev = '\0';
    while (*word) {
        char current = *word;
        if (isalpha(current)) {
            if (tolower(current) <= tolower(prev)) {
                return 0; 
            }
            prev = current;
        }
        word++;
    }
    return 1;
}

int main() {
    State state = STATE_START;
    char c;
    int wordCount = 0;
    char currentWord[50];
    int currentIndex = 0;

    while ((c = getchar()) != EOF) {
        switch (state) {
            case STATE_START:
                if (isalpha(c)) {
                    state = STATE_LEX_INCREASE;
                    currentIndex = 0;
                    currentWord[currentIndex++] = c;
                } else if (!isspace(c)) {
                    state = STATE_OTHER;
                }
                break;

            case STATE_LEX_INCREASE:
                if (isalpha(c)) {
                    currentWord[currentIndex++] = c;
                } else if (isspace(c)) {
                    currentWord[currentIndex] = '\0';
                    wordCount += isLexIncreasing(currentWord);
                    state = STATE_START;
                } else {
                    state = STATE_OTHER;
                }
                break;

            case STATE_OTHER:
                if (isspace(c)) {
                    state = STATE_START;
                }
                break;
        }
    }

    if (state == STATE_LEX_INCREASE) {
        currentWord[currentIndex] = '\0';
        wordCount += isLexIncreasing(currentWord);
    }

    printf("Количество слов с лексикографически возрастающими буквами: %d\n", wordCount);

    return 0;
}

```
5. **Вывод**: Работа является очень важной, так как написание этой программы позволит писать программы на С с использованием fsm
